<unk>	0
<s>	0
</s>	0
▁=	-3.2769
▁i	-3.69574
▁"	-3.71748
,	-3.72304
;	-3.74712
▁n	-3.77406
▁(	-3.8334
[	-3.84706
i	-3.98709
▁a	-4.00189
▁to	-4.1069
▁if	-4.17457
▁<<	-4.2127
]	-4.31721
▁{	-4.34566
"	-4.38564
▁for	-4.52731
▁>>	-4.54671
▁	-4.58074
▁s	-4.58464
▁-	-4.60561
▁+	-4.61556
▁long	-4.61989
int	-4.63827
▁0	-4.64387
)	-4.65154
▁is	-4.69486
▁b	-4.69726
▁and	-4.73504
▁int	-4.75449
;"	-4.76205
▁1	-4.84263
▁else	-4.88193
▁x	-4.88909
(	-4.97575
▁m	-4.99983
▁j	-5.00772
n	-5.03928
▁0;	-5.04948
▁cin	-5.05691
▁of	-5.06619
▁print	-5.07722
▁c	-5.07862
▁k	-5.08004
▁read	-5.09678
▁<	-5.10633
▁ans	-5.12734
▁==	-5.13632
▁""	-5.15023
▁endl	-5.18001
++)	-5.19878
▁*	-5.26896
▁integer	-5.2762
▁set	-5.32638
j	-5.35699
a	-5.38025
1	-5.39761
▁with	-5.42689
▁cout	-5.45414
▁t	-5.48675
▁y	-5.51809
""	-5.54617
▁1;	-5.55566
.	-5.55909
▁/	-5.57035
▁2	-5.59658
▁}	-5.60665
2	-5.61123
▁exclusive	-5.63111
cout	-5.67591
s	-5.67936
▁sum	-5.68893
if	-5.75234
▁increment	-5.78512
▁<=	-5.81038
▁d	-5.82492
▁%	-5.84097
▁p	-5.84918
▁the	-5.87293
▁create	-5.89389
▁while	-5.9162
▁than	-5.93168
x	-5.93393
▁equal	-5.9655
▁l	-5.98175
▁return	-5.99452
▁v	-6.00967
▁r	-6.02934
▁by	-6.03953
print	-6.0523
];	-6.07206
▁>	-6.09722
_	-6.11383
▁'	-6.14106
▁0)	-6.14461
▁integers	-6.15282
▁1)	-6.16232
▁string	-6.17659
][	-6.19185
▁&	-6.2107
++;	-6.22913
▁0,	-6.23211
for	-6.2433
▁from	-6.25287
&	-6.25381
▁size	-6.25792
▁arr	-6.26216
long	-6.26391
▁+=	-6.27101
▁cnt	-6.27384
▁array	-6.30595
▁new	-6.33954
▁declare	-6.35956
▁be	-6.37365
▁newline	-6.38221
b	-6.38898
=	-6.41306
▁value	-6.45168
▁inclusive	-6.46958
▁min	-6.49982
▁!=	-6.50807
[0]	-6.51585
▁let	-6.52117
▁greater	-6.53499
▁max	-6.53986
k	-6.54175
▁1]	-6.55293
▁f	-6.55676
"""	-6.59515
t	-6.59828
'	-6.6009
▁>=	-6.60184
);	-6.61347
▁or	-6.61852
3	-6.6289
▁break	-6.63383
▁loop	-6.63853
▁true	-6.64693
▁less	-6.66765
O	-6.67399
e	-6.70958
▁num	-6.72156
▁count	-6.75184
▁res	-6.75246
1,	-6.75528
▁flag	-6.75763
f	-6.7993
create	-6.80114
d	-6.80536
size	-6.81132
c	-6.82181
NO	-6.83645
▁str	-6.83838
▁not	-6.83878
▁q	-6.86709
();	-6.87129
m	-6.87139
ing	-6.87966
▁temp	-6.88578
▁line	-6.8939
y	-6.91214
read	-6.92742
▁3	-6.93723
()	-6.94926
YES	-6.96321
])	-6.99054
▁then	-6.99212
▁10	-7.01893
▁input	-7.03546
<	-7.0362
▁2;	-7.03794
[1]	-7.06416
▁z	-7.06735
▁const	-7.0706
▁2)	-7.08088
▁length	-7.08853
▁decrement	-7.09024
▁false	-7.09888
>	-7.11309
▁function	-7.13164
declare	-7.14403
▁w	-7.14724
p	-7.14805
▁0"	-7.15274
\	-7.16746
l	-7.17446
▁N	-7.1867
▁1,	-7.21261
▁vector	-7.23139
▁++	-7.23259
▁char	-7.23822
=0	-7.25699
||	-7.25749
r	-7.2719
ans	-7.27536
▁""\	-7.28259
▁h	-7.29021
string	-7.29101
▁do	-7.29106
]"	-7.29645
▁mod	-7.30539
▁-1	-7.31148
▁increase	-7.35185
▁assign	-7.36214
▁change	-7.399
▁modulo	-7.39934
▁variable	-7.40022
▁len	-7.40888
▁in	-7.42446
o	-7.42536
▁4	-7.42703
▁dp	-7.43565
▁add	-7.43846
v	-7.44441
▁ch	-7.47781
▁5	-7.49564
▁A	-7.50733
▁bool	-7.52963
2,	-7.53353
▁following	-7.55738
let	-7.56237
▁'\	-7.57801
')	-7.58648
▁abs	-7.59173
▁as	-7.60004
--)	-7.60201
▁g	-7.60508
▁((	-7.60926
▁tmp	-7.61589
▁{"	-7.61684
))	-7.62824
▁u	-7.64083
▁result	-7.64515
▁e	-7.66633
length	-7.69545
▁character	-7.72489
▁elements	-7.73928
';	-7.75086
push	-7.76463
▁one	-7.76859
[2]	-7.77403
▁constant	-7.77755
▁gcd	-7.78753
▁7	-7.79498
▁arguments	-7.79945
sort	-7.8039
cin	-7.80521
sum	-7.8059
back	-7.80951
▁output	-7.81468
--;	-7.81747
arr	-7.82385
▁maxn	-7.82906
▁mx	-7.83119
▁1"	-7.8429
▁end	-7.85158
▁element	-7.85917
▁-=	-7.8633
],	-7.87929
▁st	-7.88824
2)	-7.88922
-	-7.90195
▁sort	-7.96182
▁mp	-7.96988
end	-7.97944
▁continue	-7.98943
▁ints	-8.0027
str	-8.00655
1[	-8.01216
▁S	-8.02022
▁call	-8.02262
begin	-8.04949
▁void	-8.04983
A	-8.05801
9	-8.06092
▁10;	-8.06188
0	-8.06952
▁an	-8.07029
)"	-8.08707
▁3;	-8.08895
2;	-8.10629
D	-8.11694
while	-8.12661
u	-8.13909
(),	-8.1524
▁equals	-8.17228
set	-8.17535
▁pos	-8.17957
▁total	-8.17965
▁double	-8.17969
())	-8.18384
▁argument	-8.19789
▁1][	-8.20745
▁'0'	-8.20748
R	-8.21528
▁longs	-8.21564
▁1])	-8.21642
▁start	-8.21762
▁values	-8.22348
char	-8.22668
cnt	-8.23497
▁mn	-8.2376
▁ar	-8.24561
=1	-8.24773
▁boolean	-8.25499
2[	-8.25706
▁M	-8.25762
"")	-8.26202
▁8	-8.26206
ed	-8.26292
▁variables	-8.26516
▁strings	-8.26643
▁?	-8.27032
1)	-8.28079
▁standar	-8.28343
▁(!	-8.28683
▁run	-8.28698
return	-8.29178
in	-8.29935
▁:	-8.30324
Read	-8.30387
▁B	-8.31829
▁mid	-8.32129
▁solve	-8.3401
▁first	-8.34134
▁vis	-8.34893
h	-8.36515
q	-8.36653
max	-8.373
▁MOD	-8.37376
].	-8.37399
▁T	-8.37423
▁6	-8.3743
5	-8.37803
num	-8.39344
▁INF	-8.39441
▁-1,	-8.39504
▁100	-8.40352
▁make	-8.40603
▁name	-8.41264
▁absolute	-8.41872
▁index	-8.4266
flag	-8.42722
[3]	-8.42858
z	-8.42879
min	-8.43188
▁it	-8.44256
1;	-8.45009
▁check	-8.45114
▁sizeof	-8.47162
▁ok	-8.47333
▁5;	-8.47604
▁cur	-8.49285
N	-8.49666
▁decrease	-8.49984
]);	-8.50111
▁now	-8.50278
▁last	-8.50588
▁o	-8.52224
▁minimum	-8.53429
▁that	-8.54689
"",	-8.54754
temp	-8.55436
second	-8.56026
+	-8.57456
▁even	-8.5765
S	-8.58221
"";	-8.58558
▁at	-8.58795
▁val	-8.59304
first	-8.59904
▁""|	-8.63079
2"	-8.63094
▁3)	-8.6371
▁NO	-8.63738
▁maximum	-8.64183
▁1);	-8.66633
-1]	-8.67046
▁counter	-8.67515
else	-8.68388
▁)	-8.6887
▁4;	-8.696
▁1000	-8.69961
▁2,	-8.70363
▁ss	-8.70372
res	-8.70561
▁|	-8.70748
w	-8.70908
▁arrays	-8.71024
g	-8.71501
',	-8.72247
▁C	-8.72249
▁maxx	-8.72392
▁YES	-8.72492
memset	-8.72776
▁swap	-8.72909
▁append	-8.73345
▁R	-8.73544
▁ret	-8.74182
B	-8.74234
abs	-8.74439
pos	-8.74711
T	-8.74741
L	-8.748
MAX	-8.75216
▁are	-8.75422
map	-8.76228
][0]	-8.76314
▁map	-8.76957
count	-8.77227
▁L	-8.78264
▁1))	-8.78588
LL	-8.79364
▁1];	-8.80427
ch	-8.81033
▁stop	-8.81917
▁inf	-8.81999
▁-1;	-8.82253
▁prime	-8.8336
▁user	-8.83744
insert	-8.84609
']	-8.86366
▁second	-8.86407
<<	-8.88676
▁7;	-8.89142
▁all	-8.89207
▁INT	-8.89824
▁vec	-8.90866
3,	-8.91183
integers	-8.91392
▁otherwise	-8.91973
▁MAX	-8.92569
▁getchar	-8.93307
▁105	-8.93433
▁push	-8.9465
4	-8.9466
▁characters	-8.95572
[4]	-8.9584
▁define	-8.96542
▁tot	-8.96567
]++;	-8.96652
]]	-8.97707
▁insert	-8.98056
+1]	-8.99097
(""	-8.99173
▁cost	-8.99185
▁right	-9.00431
*	-9.00755
dp	-9.00791
integer	-9.00807
▁tak	-9.01634
++	-9.0204
maxn	-9.02182
array	-9.02202
▁left	-9.02414
find	-9.02732
▁minn	-9.03382
▁'1'	-9.03454
-1	-9.03675
▁on	-9.04094
▁dfs	-9.04354
▁divide	-9.05125
▁2]	-9.06344
▁""0""	-9.07159
][1]	-9.07615
U	-9.08404
▁cont	-9.0857
▁row	-9.08856
▁,	-9.08935
▁times	-9.10382
▁odd	-9.10579
▁time	-9.10961
▁8;	-9.13221
▁26	-9.13357
());	-9.13374
▁answer	-9.1365
),	-9.15276
▁!	-9.15331
▁iteration	-9.15799
▁MAXN	-9.16269
▁number	-9.16397
▁aux	-9.1785
▁each	-9.18053
1.	-9.18604
M	-9.18945
▁""-1""	-9.19102
puts	-9.20322
▁pre	-9.20838
▁strlen	-9.20858
▁10)	-9.20962
vector	-9.21139
gcd	-9.21348
[0];	-9.21456
));	-9.21791
▁""+	-9.22198
▁'0')	-9.22366
[5]	-9.23764
st	-9.2424
▁xx	-9.24704
▁maxi	-9.24807
C	-9.25336
+1	-9.25799
len	-9.26223
▁4)	-9.26922
substr	-9.27121
▁ara	-9.27977
▁9	-9.28068
pair	-9.2837
▁pointer	-9.29385
▁5)	-9.29526
▁%=	-9.30652
▁curr	-9.3078
tmp	-9.31767
▁'0';	-9.31772
▁subtract	-9.32227
▁remove	-9.32286
▁101	-9.32414
bool	-9.33593
[0])	-9.33744
▁X	-9.34983
start	-9.35514
--	-9.36282
▁next	-9.36346
▁diff	-9.36437
0,	-9.36878
▁prev	-9.36914
▁dist	-9.37413
▁P	-9.37784
▁-1)	-9.38257
mx	-9.38282
▁D	-9.38326
▁takes	-9.38465
▁'*'	-9.39188
[1])	-9.39304
▁mini	-9.39373
▁bitwise	-9.3945
Yes	-9.39957
No	-9.4011
▁exit	-9.40123
/	-9.40286
▁1000000007	-9.40593
▁mark	-9.40613
▁col	-9.40675
▁60	-9.4082
▁truthy	-9.41407
▁no	-9.41429
▁out	-9.41671
getline	-9.4219
▁between	-9.42435
▁two	-9.42547
6	-9.42686
1++;	-9.43082
▁ct	-9.43157
1[0]	-9.4317
▁initialize	-9.43531
▁inline	-9.44158
▁space	-9.4451
▁ma	-9.44977
it	-9.45265
['	-9.45516
▁different	-9.45547
▁unsigned	-9.46797
mp	-9.46911
th	-9.47328
((	-9.47437
▁20	-9.47491
▁""#""	-9.4788
X	-9.48059
cur	-9.48418
▁top	-9.48579
▁dy	-9.49027
▁current	-9.49337
▁7)	-9.49402
▁sqrt	-9.50254
▁{0};	-9.50783
▁step	-9.50963
to	-9.51243
▁reading	-9.51248
▁casted	-9.51325
▁base	-9.51337
P	-9.51529
increment	-9.51766
▁'-'	-9.51879
▁Max	-9.52184
▁12	-9.52239
I	-9.5262
▁'-')	-9.52774
double	-9.53442
▁(2	-9.53705
▁30	-9.54098
▁'1')	-9.54304
▁data	-9.54563
▁test	-9.55004
vis	-9.55288
▁down	-9.5574
▁word	-9.56863
▁G	-9.57611
index	-9.57618
▁beginning	-9.58284
▁get	-9.59343
▁both	-9.59508
▁""1""	-9.59588
▁6;	-9.598
1[1]	-9.59857
loop	-9.59861
[105];	-9.60355
F	-9.60705
▁15	-9.61076
▁day	-9.62363
▁acos	-9.62716
▁co	-9.62784
}	-9.62864
▁bytes	-9.62885
▁position	-9.63209
G	-9.63529
IG	-9.63674
[0],	-9.6373
▁1005	-9.63739
▁dx	-9.64718
[0][0]	-9.65295
▁power	-9.6596
▁ceil	-9.65993
3)	-9.66362
(0);	-9.66648
▁rem	-9.66951
now	-9.67551
▁pow	-9.68108
▁idx	-9.68226
[0][	-9.69624
▁100;	-9.69839
▁{0}	-9.70092
▁__	-9.70254
▁'.'	-9.70448
void	-9.70604
at	-9.70885
▁cmp	-9.70945
▁dis	-9.71327
▁2);	-9.71971
++]	-9.72386
▁empty	-9.72591
▁PI	-9.72832
function	-9.72889
erase	-9.7305
is	-9.73353
▁zero	-9.73644
▁100000	-9.74509
▁mm	-9.74544
(0,	-9.74552
▁110	-9.74777
rock	-9.74802
scissors	-9.75006
64	-9.75132
3;	-9.75621
W	-9.7566
paper	-9.76034
▁find	-9.76227
call	-9.77312
▁pq	-9.774
1"	-9.77547
-|	-9.7764
▁plus	-9.7783
▁100005	-9.78723
▁my	-9.78936
get	-9.79441
▁up	-9.7947
▁1000000007;	-9.79539
▁"",	-9.79766
▁substring	-9.79849
|	-9.79859
▁can	-9.81256
2++;	-9.81407
▁price	-9.8156
or	-9.8187
▁Y	-9.82622
▁pair	-9.82862
▁fa	-9.83141
[6]	-9.83422
▁10,	-9.83503
true	-9.83514
▁_	-9.83775
"")"	-9.83784
▁lcm	-9.83796
▁score	-9.83909
▁""-	-9.84459
check	-9.84792
2.	-9.85564
▁go	-9.85815
OOOO	-9.86266
mid	-9.8666
▁cek	-9.86836
▁ind	-9.87029
/2	-9.87161
nt	-9.87225
prime	-9.87536
7	-9.87955
▁25	-9.88038
▁sz	-9.88251
▁'#'	-9.89103
SEGMENT	-9.8932
▁'+'	-9.89658
pop	-9.89658
Second	-9.89752
top	-9.90169
!	-9.90349
▁'9')	-9.9045
Friendship	-9.90794
▁1000;	-9.91011
here	-9.91179
▁fast	-9.91189
▁'+')	-9.91295
▁""*""	-9.91671
▁1001	-9.92053
▁{}	-9.9215
▁'9'	-9.92372
re	-9.92444
▁'*')	-9.92489
▁50	-9.92544
decrement	-9.92632
▁yy	-9.92842
3"	-9.92931
make	-9.93288
mn	-9.93302
▁kol	-9.93695
▁freq	-9.93876
▁np	-9.94084
const	-9.94205
▁""*"";	-9.94227
First	-9.94387
▁bb	-9.94477
[0][1]	-9.94485
▁found	-9.94785
->	-9.95487
ar	-9.96267
1]	-9.96807
▁{0,	-9.96934
clear	-9.97308
|)""	-9.97673
▁200	-9.97726
]))	-9.97748
▁op	-9.9801
▁digit	-9.98228
TRIANGLE	-9.98401
▁multiply	-9.98555
▁fb	-9.98724
▁high	-9.98904
!""	-9.99006
▁ex	-9.99046
▁5,	-9.99203
2[0]	-9.99348
▁hi	-9.99641
▁init	-10.0065
▁lo	-10.0101
▁mat	-10.0145
▁win	-10.0146
▁root	-10.0186
empty	-10.0226
OO	-10.0287
ok	-10.0302
reverse	-10.0359
▁nl	-10.0458
▁11	-10.0523
iterator	-10.0556
OOO	-10.0586
▁8)	-10.0604
val	-10.064
▁mi	-10.07
▁'4'	-10.0701
MAXN	-10.0749
▁reverse	-10.0797
"");	-10.0807
▁"".""	-10.0826
▁multiple	-10.0858
▁coun	-10.092
left	-10.0938
▁{1,	-10.0953
idx	-10.1006
▁""-1	-10.1011
0;	-10.1017
▁(((	-10.1032
▁letter	-10.1068
define	-10.107
[3];	-10.1087
maxx	-10.1096
▁bit	-10.1174
▁primes	-10.1255
2]	-10.1282
▁lower	-10.131
LEFT	-10.1331
PRINT	-10.1346
▁EPS	-10.1396
▁accept	-10.1397
▁#	-10.1418
illed	-10.1427
▁inp	-10.1506
▁rest	-10.151
time	-10.1537
▁item	-10.1542
▁2))	-10.1546
[1],	-10.1563
[100];	-10.1567
▁cc	-10.1629
>::	-10.1675
▁further	-10.168
▁square	-10.1696
▁-1}	-10.1698
▁10000	-10.1769
▁55	-10.1836
▁endline	-10.1855
▁cal	-10.1859
[1][	-10.1863
▁need	-10.1867
(2,	-10.1876
▁sol	-10.1887
▁order	-10.1911
[2])	-10.1933
▁26;	-10.1952
▁tb	-10.1953
▁low	-10.1988
Y	-10.1991
▁6)	-10.1992
▁iterat	-10.2021
IMPOSSIBLE	-10.2025
▁(1)	-10.2043
input	-10.2052
▁judge	-10.2113
name	-10.2121
[1];	-10.2123
al	-10.2147
▁dif	-10.2157
▁pr	-10.2159
▁sy	-10.2178
▁vv	-10.2266
▁""#	-10.2267
▁bitshift	-10.2271
[1][0]	-10.2284
▁best	-10.2289
9;	-10.2339
▁color	-10.2343
▁adj	-10.2343
▁48	-10.2365
▁tt	-10.2391
▁div	-10.2443
▁dem	-10.2465
element	-10.2476
▁isprime	-10.2515
change	-10.2518
(0)	-10.2559
▁4,	-10.2641
""]	-10.2645
[1005];	-10.265
▁W	-10.2659
▁""/""	-10.266
ss	-10.2679
▁Min	-10.2765
[8]	-10.2796
▁back	-10.2822
▁book	-10.287
▁eps	-10.2926
▁'8'	-10.2993
▁re	-10.3012
DOWN	-10.304
UP	-10.3049
8	-10.305
Time	-10.3066
▁1],	-10.3089
▁(1	-10.3126
[105],	-10.3166
[100005];	-10.3186
[101];	-10.3197
][2]	-10.3205
▁isPrime	-10.3216
[1][1]	-10.3311
▁minx	-10.3325
1);	-10.3341
▁tp	-10.339
▁upper	-10.3428
▁valid	-10.3453
row	-10.35
[2];	-10.3527
-----------	-10.3542
▁'#';	-10.3554
▁resp	-10.3579
[10];	-10.3594
▁grid	-10.3628
▁'.')	-10.3636
out	-10.3662
2);	-10.3662
]]++;	-10.3686
▁'('	-10.3688
swap	-10.369
and	-10.3691
▁which	-10.3745
▁dimension	-10.3752
▁myset	-10.3779
▁store	-10.3811
▁1}	-10.3812
▁chars	-10.3812
MIN	-10.3836
ll	-10.3844
add	-10.3849
[4];	-10.3912
▁us	-10.3916
▁WINS	-10.3922
▁queue	-10.3951
▁se	-10.3967
▁""#"";	-10.3983
▁Arr	-10.3992
2[1]	-10.4026
▁table	-10.4066
[1000];	-10.4068
▁joy	-10.4097
▁100001	-10.4128
18	-10.4129
▁1000000	-10.4204
▁shift	-10.4218
▁iterator	-10.424
▁skip	-10.4284
▁gap	-10.429
31,	-10.4311
▁hh	-10.4315
▁con	-10.4327
▁ada	-10.4341
cmp	-10.4362
▁remainder	-10.4381
▁points	-10.4384
▁looping	-10.443
[110];	-10.4452
diff	-10.4462
▁br	-10.4487
mod	-10.4491
[7]	-10.4494
▁show	-10.4504
result	-10.4513
front	-10.4531
▁chest	-10.4542
▁display	-10.4548
▁fabs	-10.455
[2][1]	-10.456
unsigned	-10.457
▁ca	-10.4573
▁ck	-10.4576
▁9;	-10.459
last	-10.4605
▁--	-10.4605
------------	-10.4611
▁minus	-10.4613
▁visited	-10.4625
▁360	-10.463
▁Number	-10.4637
▁used	-10.4657
▁rows	-10.4669
▁"""";	-10.4721
▁type	-10.4735
▁suma	-10.482
ret	-10.4836
Correct	-10.4903
▁0}	-10.4925
▁fixed	-10.4951
▁magic	-10.4959
▁id	-10.4992
▁fill	-10.5015
txt	-10.5021
assign	-10.5057
[1][2]	-10.5076
▁nums	-10.5121
▁sb	-10.5127
Akshat	-10.5127
▁clear	-10.5134
number	-10.5136
ER	-10.5158
▁stack	-10.5181
▁sign	-10.5194
▁stdout	-10.5262
▁OR	-10.5279
▁I	-10.5287
▁250)	-10.5302
no	-10.5324
▁level	-10.5325
RU	-10.5383
red	-10.5392
▁fuel	-10.5394
▁stream	-10.5394
▁move	-10.5425
▁fin	-10.5427
▁father	-10.5443
4,	-10.5445
▁items	-10.546
total	-10.5467
▁visit	-10.5482
▁blue	-10.5483
▁'*';	-10.5488
▁whe	-10.5505
ter	-10.5519
▁days	-10.5522
Malvika	-10.5551
▁'?'	-10.5586
cost	-10.5595
::	-10.5597
▁good	-10.5638
▁pass	-10.5641
▁1010	-10.5649
▁20;	-10.5677
▁asc	-10.5702
▁fl	-10.5709
▁biceps	-10.5734
▁statement	-10.5743
▁fact	-10.5749
]--;	-10.5752
▁sub	-10.5773
▁12;	-10.5785
sqrt	-10.5845
▁'(')	-10.5856
▁dir	-10.5893
[0][2]	-10.5904
▁exp	-10.5928
▁mult	-10.5958
-1)	-10.5993
▁point	-10.601
▁kk	-10.6025
of	-10.6052
▁100)	-10.6055
-------------	-10.6073
▁'#')	-10.6079
LU	-10.6093
▁key	-10.6093
TEAM	-10.6103
▁97	-10.612
LD	-10.6127
RD	-10.6135
▁'\0'	-10.6135
rat	-10.6137
▁su	-10.6144
▁fathercnt	-10.6165
dfs	-10.6178
op	-10.6188
▁match	-10.6195
▁gets	-10.6224
▁through	-10.623
▁file	-10.6264
▁'.';	-10.6295
asya	-10.6303
▁mas	-10.6316
exclusive	-10.6317
▁brr	-10.6339
ind	-10.6339
|)	-10.6343
▁1000000000	-10.6353
▁erase	-10.6363
▁""."";	-10.6411
▁9)	-10.6425
[2][0]	-10.6426
man	-10.6451
▁hate	-10.6467
]=	-10.6479
▁tem	-10.6486
mark	-10.6488
▁arg	-10.6502
ending	-10.6505
▁unique	-10.6505
▁moves	-10.651
▁ty	-10.6552
blue	-10.6557
▁3"	-10.6569
▁hash	-10.6609
▁red	-10.6623
▁until	-10.67
▁tc	-10.6716
▁hitung	-10.6717
▁setting	-10.6729
▁three	-10.6729
▁'8')	-10.6735
(-1.0)	-10.676
vec	-10.6771
▁ele	-10.6774
RE	-10.6779
on	-10.6809
▁after	-10.6811
▁ctr	-10.6814
▁mul	-10.6842
output	-10.6863
right	-10.6884
▁distance	-10.6886
▁""0	-10.6904
[100],	-10.6916
▁nothing	-10.6932
▁keyboard	-10.6932
▁lol	-10.6979
▁1][0]	-10.6986
[3])	-10.7012
IM	-10.7044
▁1][1]	-10.7049
display	-10.7057
AT	-10.7064
▁begin	-10.7068
▁has	-10.7088
pow	-10.7092
-9	-10.7097
▁ta	-10.7125
0)	-10.714
▁TESTS	-10.7153
▁address	-10.7177
Power	-10.7188
▁precision	-10.7188
Mahmoud	-10.7196
woman	-10.7198
keep	-10.7199
Ehab	-10.7201
lled	-10.7201
child	-10.7208
▁fun	-10.7209
▁200005	-10.7211
▁var	-10.7217
▁'1';	-10.7217
▁No	-10.7227
run	-10.7265
▁WI	-10.7266
xx	-10.7272
▁puts	-10.7315
chest	-10.7317
Reality	-10.734
Mind	-10.7343
Space	-10.7343
Soul	-10.7346
(1	-10.7372
fa	-10.7372
▁calc	-10.7385
head	-10.7385
ith	-10.7393
E	-10.7398
▁Yes	-10.742
▁reference	-10.7433
▁comp	-10.7438
-------------+""	-10.7499
▁'\0';	-10.7539
oward	-10.7547
▁content	-10.7557
▁ff	-10.7565
[2][2]	-10.7573
▁""?""	-10.7583
▁list	-10.7637
▁MIN	-10.7651
▁inv	-10.7655
come	-10.7689
=2	-10.7695
▁dep	-10.7707
▁sieve	-10.7715
▁float	-10.7745
▁compare	-10.7761
▁998244353	-10.7767
▁edges	-10.7779
1--;	-10.7781
▁board	-10.7794
▁vectors	-10.7794
[2],	-10.78
▁guy	-10.7817
▁100010	-10.782
▁'['	-10.7866
[100005]	-10.7868
▁pi	-10.7871
aren	-10.7878
[5];	-10.7878
▁half	-10.7913
▁""""	-10.7918
▁med	-10.792
--------------	-10.7926
▁tolower	-10.7947
▁numbers	-10.7961
▁priority	-10.7976
green	-10.7979
2))	-10.7998
▁(!(	-10.7999
ara	-10.8008
▁cou	-10.801
▁31	-10.8011
et	-10.8064
▁F	-10.8089
▁counting	-10.8116
▁'4')	-10.812
▁'7'	-10.8132
biceps	-10.8132
▁':'	-10.8141
▁green	-10.8177
[10]	-10.8185
▁year	-10.82
▁en	-10.8204
[3],	-10.8219
▁""#.""	-10.8236
{	-10.8245
▁round	-10.8246
▁pref	-10.8253
[""	-10.8271
[2	-10.8274
▁'7')	-10.8306
▁(180	-10.8331
');	-10.8349
[101],	-10.836
▁putchar	-10.8363
▁ac	-10.8384
▁prog	-10.8421
(3	-10.8426
▁qr	-10.8475
""}	-10.8509
[1000],	-10.8509
10	-10.8517
color	-10.8522
------------+""	-10.8526
▁Friendship	-10.8528
▁1.0	-10.8567
▁lim	-10.8581
up	-10.8585
']++;	-10.8598
▁64	-10.861
White	-10.8618
Black	-10.8618
▁infinite	-10.8647
▁columns	-10.866
queue	-10.8714
[110]	-10.8721
Mishka	-10.8725
Chris	-10.8726
▁1000000009	-10.8741
minn	-10.8758
▁32	-10.8796
-1,	-10.8834
▁starty	-10.8843
0"	-10.8843
show	-10.8865
▁spf	-10.8883
erminate	-10.8895
Color	-10.8928
[26]	-10.8931
▁goal	-10.8949
▁ql	-10.8964
▁2005	-10.8967
▁matches	-10.897
▁15)	-10.897
▁'<'	-10.9015
Anton	-10.9032
Danik	-10.9033
Penny	-10.9036
▁calling	-10.9051
value	-10.9054
▁booleans	-10.9076
ma	-10.9087
▁month	-10.9098
▁curlower	-10.9099
▁Input	-10.91
▁does	-10.9102
us	-10.9104
[9]	-10.9147
win	-10.9156
orange	-10.9163
▁':')	-10.9179
Sheldon	-10.9189
Leonard	-10.9189
Rajesh	-10.919
[1001]	-10.9213
▁rlmoves	-10.9255
▁love	-10.9255
[1005]	-10.9289
aux	-10.9304
<=	-10.932
en	-10.9331
▁180	-10.9334
▁winner	-10.9343
▁60;	-10.9357
maxi	-10.9358
(-1);	-10.9361
curr	-10.9364
[++	-10.9377
▁game	-10.9399
[1001];	-10.9426
▁sumb	-10.9428
▁le	-10.9435
▁Set	-10.9448
▁psum	-10.9499
Incorrect	-10.9505
pre	-10.9513
▁case	-10.9551
▁GCD	-10.9553
cw	-10.9592
resize	-10.9593
▁""2""	-10.9594
:	-10.9599
▁MX	-10.9615
▁exist	-10.9631
▁flg	-10.9633
▁side	-10.9634
▁extra	-10.9637
id	-10.964
▁1]);	-10.9645
-1][	-10.9668
yellow	-10.9671
Misha	-10.9672
▁0))	-10.9683
▁mymap	-10.97
▁500	-10.9723
▁cn	-10.9836
purple	-10.9838
▁Count	-10.9845
Tie	-10.985
▁U	-10.986
mini	-10.9865
▁cap	-10.9874
-----------+""	-10.9893
.""	-10.9901
▁big	-10.9902
▁doubles	-10.9906
▁sx	-10.9921
▁cot	-10.9948
position	-10.9966
▁tm	-10.9971
▁yes	-10.9988
an	-11.0073
prev	-11.0074
▁rat	-11.0114
1][	-11.0125
▁Ans	-11.0177
▁write	-11.0177
▁maxm	-11.019
---------------	-11.0219
▁contain	-11.0231
.#.#.#.#.#.	-11.0234
▁front	-11.0243
('	-11.0262
[100000]	-11.027
2[1])	-11.0323
ccw	-11.037
▁iter	-11.0402
nd	-11.0415
▁log	-11.0422
30,	-11.0448
tot	-11.045
▁goto	-11.0451
precision	-11.0451
▁2])	-11.0465
▁txt	-11.0482
false	-11.0499
▁mov	-11.0528
captain	-11.0528
Dodecahedron	-11.055
Tetrahedron	-11.055
Octahedron	-11.0551
▁cond	-11.0557
Cube	-11.0561
NG	-11.0566
▁shu	-11.0569
▁alpha	-11.0627
▁1]))	-11.0636
▁cy	-11.0654
new	-11.0657
▁lessons	-11.0666
step	-11.0684
▁pp	-11.0692
▁tam	-11.0698
▁gr	-11.0699
▁rec	-11.0728
▁same	-11.0745
▁nCr	-11.0755
▁cycle	-11.076
la	-11.0774
_1	-11.0815
▁way	-11.0822
▁2*	-11.0843
▁(360	-11.0871
[0]);	-11.0872
)(	-11.0872
▁120	-11.0883
▁weak	-11.0895
▁(0);	-11.09
▁'0');	-11.0932
▁oo	-11.0938
one	-11.0943
tc	-11.0976
▁coins	-11.0985
▁diag	-11.0996
▁status	-11.1023
base	-11.1051
(2	-11.1063
▁tab	-11.1078
▁cup	-11.1086
▁fix	-11.1093
▁menor	-11.1101
]])	-11.1102
▁stringstream	-11.1117
▁dat	-11.1145
append	-11.1167
▁20)	-11.117
▁open	-11.118
oke	-11.1182
co	-11.1183
rem	-11.1194
▁998244353;	-11.1225
fabs	-11.1227
▁!(	-11.1227
.#.#.#.#.	-11.1242
float	-11.1242
▁letters	-11.1248
18;	-11.1252
▁lenb	-11.1261
▁proceed	-11.1262
▁asd	-11.1278
▁itr	-11.1283
▁200000	-11.1284
▁startx	-11.1306
▁""5""	-11.1309
▁par	-11.1318
cast	-11.1324
=0,	-11.1339
▁sup	-11.1365
ct	-11.1384
▁edge	-11.1388
▁rl	-11.1394
▁toupper	-11.144
▁tim	-11.1465
▁contador	-11.1471
▁fi	-11.1496
solve	-11.1497
▁cell	-11.1498
counter	-11.1513
9,	-11.1514
▁counts	-11.1516
signed	-11.1564
▁dig	-11.1583
▁ll	-11.1599
▁ed	-11.1603
▁place	-11.1604
▁Solve	-11.1642
▁32;	-11.167
][1])	-11.1675
Equal	-11.168
ng	-11.1684
----------+""	-11.1689
RA	-11.1693
lo	-11.1709
..........	-11.1727
▁')')	-11.1735
▁graph	-11.1739
col	-11.1754
[105]	-11.1756
▁240	-11.1756
-2]	-11.1759
▁'>'	-11.1781
mber	-11.1787
2=	-11.1832
home	-11.1833
▁stdin	-11.1839
▁100,	-11.1863
▁1000005	-11.1874
line	-11.1883
Icosahedron	-11.1901
▁args	-11.1934
low	-11.1944
▁sq	-11.198
[3][3];	-11.1994
▁10);	-11.1994
es	-11.202
▁')'	-11.204
▁{};	-11.2096
▁11;	-11.2108
▁was	-11.2123
+1][	-11.2131
points	-11.2159
▁bits	-11.2165
▁lst	-11.2184
till	-11.2195
data	-11.2201
▁des	-11.2215
>=	-11.2227
▁86400	-11.2236
▁uneven	-11.2243
▁reduce	-11.2243
▁rounded	-11.2245
▁matrix	-11.225
found	-11.227
▁""4""	-11.2277
oo	-11.2282
▁pw	-11.2284
▁30;	-11.2289
▁100000;	-11.2298
freopen	-11.2299
▁setprecision	-11.2305
▁22	-11.2321
Masha	-11.2322
Dasha	-11.2327
▁rta	-11.2327
ceil	-11.2332
%	-11.2379
▁1000000007)	-11.2394
▁memset	-11.2403
▁prices	-11.2419
▁seq	-11.2432
▁96	-11.2436
2(	-11.2438
▁ms	-11.2441
zxcvbnm	-11.2442
strcpy	-11.2444
▁lucky	-11.2448
▁pop	-11.2449
sdfghjkl	-11.2449
▁final	-11.2453
▁tx	-11.2457
next	-11.2464
▁numOps	-11.2466
▁16	-11.2483
team	-11.2489
▁squared	-11.2494
Max	-11.2501
▁bfs	-11.2501
act	-11.2544
▁levels	-11.2551
▁1].	-11.2575
▁200001	-11.2579
▁udmoves	-11.2609
▁250	-11.2618
▁req	-11.2622
▁'?')	-11.2634
[100000];	-11.2645
▁aa	-11.2649
tr	-11.2656
▁large	-11.2683
dif	-11.2698
#.#.#.#.#.#.	-11.2704
2[0])	-11.2707
...........	-11.2709
exp	-11.2712
the	-11.2723
▁10]	-11.273
UR	-11.2739
Alice	-11.2741
▁md	-11.276
inline	-11.2763
▁turn	-11.2764
▁votes	-11.2779
▁dim	-11.2784
▁cx	-11.2796
dx	-11.2825
not	-11.2837
▁reset	-11.285
[]	-11.2862
▁51	-11.2869
qwertyuiop	-11.2873
▁respectively	-11.2882
[100001];	-11.2888
▁more	-11.2898
▁2}	-11.2901
▁light	-11.2905
ta	-11.2913
▁divisor	-11.2914
▁state	-11.2937
root	-11.2942
][1];	-11.2945
/10	-11.2946
visited	-11.295
----------------	-11.2952
[105][105];	-11.2955
[0]++;	-11.296
whichPosn	-11.2961
Bob	-11.2973
TIE	-11.2973
▁star	-11.2978
▁12)	-11.2986
▁"""	-11.2991
[1010]	-11.3
▁48;	-11.3037
▁men	-11.3045
▁players	-11.309
asilisa	-11.3095
▁rep	-11.3099
▁least	-11.3103
▁positive	-11.3111
4;	-11.3146
[10],	-11.3152
[101][101];	-11.3152
▁gl	-11.3158
compare	-11.3183
kol	-11.3185
[11]	-11.3213
▁lca	-11.3216
dest	-11.3232
▁sm	-11.3254
log	-11.3271
ly	-11.3272
▁bl	-11.3287
▁First	-11.329
▁man	-11.329
▁reg	-11.3301
anako	-11.331
optimization	-11.3322
[200];	-11.3324
word	-11.3325
[200]	-11.3329
▁Rozdil	-11.333
(10	-11.3346
▁limit	-11.3367
7,	-11.3383
▁maxy	-11.3385
▁clock	-11.3387
▁multiplie	-11.3406
subtractions	-11.3412
contest	-11.3424
▁18	-11.3438
▁save	-11.3439
▁del	-11.3446
▁3]	-11.3447
▁pot	-11.3494
▁home	-11.3504
reg	-11.352
▁work	-11.3522
that	-11.3526
▁poly	-11.3528
▁ver	-11.3547
▁weight	-11.3556
▁solution	-11.3571
▁toggle	-11.3588
▁steps	-11.3614
▁MN	-11.3618
▁oven	-11.363
▁13	-11.3635
▁modul	-11.3648
▁27	-11.3661
[0].	-11.3668
▁speed	-11.3671
undefined	-11.3677
]),	-11.3697
1))	-11.3707
Slava	-11.3793
bound	-11.3799
▁UP	-11.3805
▁falsy	-11.3807
▁factor	-11.3811
▁DOWN	-11.3825
▁5];	-11.385
▁2000	-11.3866
day	-11.3878
▁head	-11.3879
---------+""	-11.389
▁el	-11.3901
unique	-11.3917
Danil	-11.3931
Nikita	-11.3931
er	-11.3936
Olya	-11.3937
DL	-11.3985
Ann	-11.3987
ary	-11.3993
▁sc	-11.4001
=3	-11.4006
▁10000000	-11.4013
▁""-""	-11.4015
alue	-11.4023
nto	-11.4034
[100001]	-11.4042
▁""1/2""	-11.4068
▁buf	-11.4072
dist	-11.4088
............	-11.4092
5;	-11.4095
▁501	-11.4097
rest	-11.4112
▁220	-11.4122
(-1)	-11.4136
▁""|#.	-11.4148
▁1));	-11.415
▁pl	-11.4164
▁whichPosn	-11.4186
Ciel	-11.4188
ULDR	-11.4189
▁102	-11.4189
[10000];	-11.4222
▁fy	-11.4222
▁lena	-11.424
▁money	-11.4247
▁13)	-11.4255
▁ones	-11.4268
▁clo	-11.4275
dg	-11.4287
▁captain	-11.4292
ARD	-11.4294
▁CUR	-11.4295
▁decreasing	-11.4297
(1);	-11.4314
▁Second	-11.4321
▁Pic	-11.4334
▁remaining	-11.4335
▁participants	-11.4367
▁xay	-11.4378
▁vs	-11.4381
▁put	-11.4402
+1)	-11.4404
▁chess	-11.4406
ignore	-11.4445
UL	-11.4456
▁nex	-11.4472
▁35	-11.4488
>())	-11.4526
▁width	-11.455
▁every	-11.4551
▁nonzero	-11.4551
▁LCM	-11.4559
▁""5/6""	-11.4576
▁""1/3""	-11.4577
▁""2/3""	-11.4577
▁act	-11.4582
▁jum	-11.4587
▁chang	-11.4588
-2	-11.459
▁65	-11.4605
▁qq	-11.4614
upper	-11.4634
▁ys	-11.4663
jj	-11.4684
mm	-11.4688
▁sumr	-11.4696
need	-11.4697
isdigit	-11.4724
+2]	-11.4742
▁exe	-11.4765
▁fx	-11.4794
To	-11.4796
▁bottles	-11.482
▁5001	-11.4822
▁""+""	-11.4824
[3][3]	-11.4827
▁rotate	-11.4833
[100010]	-11.4834
-8	-11.4836
▁salt	-11.4841
as	-11.4843
increase	-11.485
▁sp	-11.4852
turn	-11.4855
▁increas	-11.4855
2--;	-11.486
score	-11.4864
▁bills	-11.4869
[100]	-11.4888
▁105;	-11.4898
▁answ	-11.4907
▁team	-11.4927
▁words	-11.4946
[30];	-11.495
▁'[')	-11.4954
▁),	-11.4962
▁names	-11.4964
[200005];	-11.4974
ome	-11.4992
▁fff	-11.4993
▁answers	-11.5
▁miny	-11.5014
-------------+	-11.5016
DR	-11.5023
)((	-11.5028
mxm	-11.5045
▁123	-11.5048
[101]	-11.5052
▁amount	-11.5071
▁Need	-11.5093
▁execute	-11.5095
▁largest	-11.5096
▁loss	-11.5105
▁10005	-11.5106
▁gg	-11.5131
▁hasil	-11.5132
hash	-11.5135
▁contains	-11.5156
▁bob	-11.5168
▁matriz	-11.5172
▁sh	-11.5195
>>	-11.522
▁sumz	-11.522
▁""|""	-11.526
owel	-11.5282
isprime	-11.5304
▁16)	-11.531
▁dos	-11.5332
digit	-11.5336
[30]	-11.534
▁1000000;	-11.5341
▁factorial	-11.5362
▁zz	-11.5371
▁bottom	-11.5373
▁cha	-11.538
[1].	-11.5387
▁36	-11.5393
reate	-11.5458
inp	-11.546
[10000]	-11.5465
▁48)	-11.548
-1"	-11.5489
>0	-11.549
▁done	-11.5509
▁mode	-11.5513
▁mo	-11.5521
[6];	-11.5534
cek	-11.5547
4"	-11.5562
▁tar	-11.5567
open	-11.5579
9)	-11.5588
absolute	-11.5613
▁hav	-11.5637
▁method	-11.5647
▁Output	-11.5647
▁lowercase	-11.5648
▁other	-11.5672
▁stone	-11.5681
▁static	-11.5688
▁cards	-11.5689
▁201	-11.5693
▁que	-11.5693
,./""	-11.5695
▁vest	-11.5698
▁password	-11.57
▁ope	-11.5728
▁command	-11.573
▁Cnt	-11.5734
div	-11.5737
▁record	-11.574
par	-11.5788
▁28	-11.5795
.#.#.#.	-11.5798
▁present	-11.5802
[5][5];	-11.5809
▁deg	-11.5814
▁Sum	-11.582
▁(7	-11.5847
▁'/'	-11.5856
▁old	-11.5861
.............	-11.5862
▁2001	-11.5862
#.#.#.#.#.#.#.	-11.5872
#.#.#.#.#.|.|)""	-11.5881
6;	-11.5889
▁jump	-11.5912
▁code	-11.5912
▁part	-11.592
.#.#.#.#.#.#.	-11.5924
▁An	-11.5933
Elephant	-11.5934
Bear	-11.5934
▁200010	-11.5938
▁jumlah	-11.5941
ve	-11.5942
▁qtb	-11.5949
▁player	-11.5952
▁indx	-11.596
▁summ	-11.5961
▁999999	-11.5961
▁distanc	-11.5969
▁previous	-11.5973
erate	-11.5975
)]	-11.5988
▁interval	-11.6005
▁xmax	-11.6014
▁endy	-11.6014
▁mishka	-11.6015
▁92	-11.6017
▁decimal	-11.606
[55];	-11.6069
_0	-11.6083
▁maps	-11.6095
()))	-11.6098
▁9,	-11.6114
▁',	-11.6119
▁29	-11.6125
list	-11.6138
*(	-11.6149
stream	-11.6151
------------+	-11.6157
impossible	-11.6162
▁short	-11.6165
EASY	-11.6191
▁(4	-11.6191
▁1]++;	-11.6199
fffffff	-11.6204
▁pairs	-11.6205
[2][	-11.6207
▁10000;	-11.6226
▁sw	-11.6227
aeiou	-11.6237
▁label	-11.6244
▁""***""	-11.6245
▁mxv	-11.6252
▁DFS	-11.6253
ay	-11.6254
............|""	-11.6259
▁convert	-11.6266
]=1	-11.6272
▁leaf	-11.6279
ad	-11.6296
▁loc	-11.6306
▁crew	-11.6313
▁parent	-11.632
▁ats	-11.6328
▁tree	-11.6334
▁its	-11.6343
▁inch	-11.6347
▁2];	-11.635
▁Chris	-11.6356
▁Mishka	-11.6358
▁cmd	-11.6376
▁1000000009;	-11.6383
sz	-11.6399
ac	-11.6403
letter	-11.6417
▁dg	-11.6468
>(	-11.6469
▁"">""	-11.6473
▁""<""	-11.6479
]-	-11.6501
▁22)	-11.6503
gap	-11.6508
--------+""	-11.6546
]]]	-11.6547
oyomi	-11.655
▁fastIo	-11.6557
▁getInt	-11.6557
▁program	-11.6557
▁inches	-11.6579
ign	-11.6585
▁cp	-11.6585
▁floor	-11.6594
▁24	-11.6606
-""	-11.6617
▁Blue	-11.6624
[1000]	-11.6624
lol	-11.6633
▁memo	-11.6649
▁carry	-11.6651
square	-11.6654
▁5000	-11.6658
▁poww	-11.6661
▁(3	-11.6669
▁pro	-11.667
[60]	-11.6676
3[	-11.6694
▁48);	-11.6697
vowel	-11.6704
▁60)	-11.6725
▁ysum	-11.6753
▁maxN	-11.6756
.............|""	-11.6765
ut	-11.6775
freq	-11.6804
best	-11.6815
.#.#.#.#.#.#.|.|	-11.6818
▁rot	-11.6829
halfplus	-11.6833
tp	-11.685
5,	-11.6876
[1000000];	-11.6877
▁given	-11.6879
▁'|'	-11.688
▁cntr	-11.6912
yes	-11.6914
▁spec	-11.6924
▁th	-11.6927
▁pole	-11.6939
ash	-11.694
▁'5')	-11.6951
▁area	-11.6954
▁have	-11.6958
▁take	-11.6966
▁""1/1""	-11.6966
▁15;	-11.6968
2[""	-11.6969
..............	-11.6974
▁box	-11.6977
▁active	-11.6981
▁mmax	-11.6994
[1010];	-11.7013
yy	-11.7043
▁buff	-11.7046
test	-11.7066
▁11)	-11.7066
▁cad	-11.7076
[0]]	-11.7084
▁bigge	-11.7095
rr	-11.7105
level	-11.712
▁plen	-11.7126
▁soroban	-11.7128
▁sumy	-11.713
half	-11.7167
um	-11.717
▁endx	-11.7172
pp	-11.7173
▁ep	-11.7176
le	-11.7188
ajout	-11.719
Alien	-11.7206
hello	-11.7206
permutation	-11.7206
▁depth	-11.7212
▁invert	-11.7212
ULL	-11.7217
▁coord	-11.7236
▁person	-11.7236
▁banyak	-11.7236
▁raw	-11.7241
▁chris	-11.7245
ex	-11.7254
ios	-11.7269
▁loct	-11.7273
▁posy	-11.7275
)))	-11.7275
▁maxs	-11.7276
-7	-11.728
▁bisa	-11.7288
][3]	-11.7288
▁frest	-11.7293
▁sumc	-11.7302
[1000005];	-11.7318
▁pri	-11.7333
2-	-11.7334
▁ad	-11.7337
▁cakes	-11.7341
▁games	-11.735
pri	-11.7368
▁stones	-11.7384
1[""	-11.7402
[12]	-11.7409
[20];	-11.7416
sign	-11.7426
▁wp	-11.7465
▁=0	-11.7466
from	-11.7475
...........|""	-11.751
▁sumA	-11.7512
▁alt	-11.7533
visit	-11.7537
colom	-11.7541
lucky	-11.7541
Impossible	-11.7541
depth	-11.7547
▁infinitely	-11.7558
).	-11.7567
▁acum	-11.759
▁300	-11.7591
▁qpow	-11.76
▁100001;	-11.7623
▁3])	-11.7631
cont	-11.7676
[5][5]	-11.7692
▁palindrome	-11.7693
▁func	-11.7711
-----------+	-11.7717
▁black	-11.7732
#.#.#.#.#.|.|""	-11.7733
▁tr	-11.7734
▁lef	-11.7735
((3	-11.7742
▁ymin	-11.7767
▁hang	-11.7776
▁vet	-11.7778
▁resta	-11.7784
▁po	-11.7795
sub	-11.7859
#.#.#.#.|.|)""	-11.7862
▁400	-11.7862
layer	-11.7872
[2005];	-11.7889
hi	-11.7891
▁prealoc	-11.7914
▁bigmod	-11.7915
▁tabla	-11.7916
dep	-11.7925
▁numOf	-11.7929
dir	-11.7933
▁ANS	-11.7938
▁lzl	-11.7939
▁liter	-11.7941
▁pv	-11.7949
▁choose	-11.7952
▁difference	-11.7953
▁biao	-11.7965
▁tstep	-11.7966
▁20000	-11.7973
▁contiguous	-11.7979
▁computer	-11.8009
▁most	-11.801
▁mask	-11.8014
1),	-11.8019
▁siz	-11.8022
[55][55];	-11.8024
▁hotels	-11.8031
card	-11.8037
][2];	-11.804
▁bao	-11.804
▁','	-11.8052
▁divis	-11.8055
▁gesture	-11.8071
OT	-11.8092
gets	-11.81
1(	-11.8102
mat	-11.8107
▁dot	-11.8112
▁bak	-11.8116
▁card	-11.8128
'))	-11.8132
▁getint	-11.8141
+1,	-11.8147
iterat	-11.8188
strlen	-11.8199
▁150	-11.8211
▁sec	-11.8218
▁beat	-11.8233
▁'5'	-11.8241
moves	-11.8242
▁dr	-11.8251
judge	-11.826
▁""1	-11.8264
fixed	-11.8269
inf	-11.827
edge	-11.827
zhuangtai	-11.8278
mymap	-11.829
used	-11.829
▁danik	-11.8297
▁slogan	-11.8297
▁condition	-11.8298
▁location	-11.8311
▁22;	-11.8325
▁finall	-11.8329
▁1005;	-11.8337
[100010];	-11.8346
▁biaoji	-11.8352
▁'}'	-11.8361
[50];	-11.8377
ck	-11.8379
▁prf	-11.8403
#.#.#.#.|.|""	-11.8404
▁misha	-11.8405
▁lie	-11.8416
▁lsum	-11.8427
▁qta	-11.8432
[100][100];	-11.8441
cc	-11.8445
▁kanan	-11.8446
][0];	-11.8453
▁OO	-11.8459
pr	-11.8468
▁node	-11.8476
[100000	-11.8476
▁search	-11.8502
▁1.0)	-11.8509
▁200;	-11.8516
▁acc	-11.8521
▁tmo	-11.8527
▁1]]	-11.8537
[26];	-11.8557
▁'!'	-11.8583
post	-11.8584
▁""3""	-11.8588
▁sir	-11.8593
dy	-11.8604
[51]	-11.8605
#.#.#.#.#.|	-11.8635
8,	-11.8639
▁sumB	-11.8643
endl	-11.8644
[50]	-11.865
▁E	-11.8654
3372036854775807	-11.8663
9+7	-11.8663
▁suff	-11.8664
flog	-11.8666
▁query	-11.8668
▁voters	-11.8669
▁jj	-11.8677
▁122	-11.868
▁205	-11.869
▁towels	-11.8693
▁'-';	-11.8703
▁imax	-11.8706
▁workTime	-11.8711
▁Map	-11.8722
▁height	-11.8741
▁deq	-11.8748
)1	-11.875
▁marks	-11.875
▁soldier	-11.8753
setf	-11.8757
npos	-11.8765
▁di	-11.879
marks	-11.8816
▁de	-11.8837
▁err	-11.8845
▁cpy	-11.886
[10][10];	-11.8873
all	-11.8897
price	-11.8897
▁numb	-11.8902
▁1001;	-11.8917
▁ds	-11.8929
▁cel	-11.8942
olume	-11.8955
[60];	-11.8961
==	-11.898
current	-11.9004
▁ways	-11.9013
▁3*	-11.9022
[1]++;	-11.9059
▁qua	-11.906
▁maxlen	-11.9063
adj	-11.9064
32	-11.9065
▁ev	-11.9066
▁negative	-11.9069
▁""25""	-11.9069
▁ymax	-11.9072
▁1][2]	-11.9074
isPrime	-11.9078
▁decrypt	-11.9083
▁quotient	-11.9083
▁smaller	-11.9083
▁bus	-11.9084
▁powmod	-11.9087
▁31}	-11.9089
▁maxa	-11.9089
▁ihash	-11.9097
▁linha	-11.9108
poly	-11.9109
▁people	-11.9112
▁larger	-11.9118
▁grest	-11.912
▁palin	-11.9123
joy	-11.9124
▁bal	-11.9139
▁four	-11.9143
▁Mod	-11.9154
LO	-11.9158
▁Cmp	-11.916
..........|""	-11.9168
tstep	-11.9181
▁pod	-11.9184
▁123;	-11.9184
▁ccw	-11.9184
▁1},	-11.919
▁tims	-11.9193
▁kkk	-11.9201
ult	-11.9211
▁dest	-11.9215
rbegin	-11.9216
▁off	-11.9219
▁""7""	-11.9232
▁10];	-11.9239
▁prevc	-11.9249
▁newsum	-11.9252
28,	-11.9253
▁xmin	-11.9263
▁""1/6""	-11.9264
▁60,	-11.9301
▁'<')	-11.9304
primes	-11.9344
▁ctx	-11.9362
ped	-11.9364
Au	-11.9373
led	-11.9376
valid	-11.9381
[102];	-11.939
TO	-11.9401
▁dsa	-11.9412
[1000	-11.9424
1-	-11.9433
ector	-11.9449
do	-11.9453
▁app	-11.9472
▁pause	-11.9485
▁geek	-11.9486
▁jumlahgenap	-11.9486
eros	-11.9488
▁TEAM	-11.9498
▁modexp	-11.9502
▁vowel	-11.9514
▁orange	-11.9514
[10005];	-11.9517
TESTS	-11.9528
▁li	-11.953
▁26)	-11.9533
exist	-11.9538
▁Alex	-11.9544
money	-11.9546
▁timr	-11.955
[11];	-11.9552
cup	-11.9552
▁page	-11.9554
▁den	-11.9555
▁pwr	-11.9564
▁seen	-11.9565
▁bs	-11.9574
][0])	-11.9587
/5	-11.96
▁25)	-11.9609
mi	-11.961
▁cop	-11.9643
▁counta	-11.9652
minimum	-11.9654
▁angle	-11.966
▁Correct	-11.9676
▁1000001	-11.9682
----------+	-11.9682
]));	-11.9692
▁lc	-11.9706
▁doit	-11.971
()));	-11.9729
INT	-11.9733
vv	-11.974
▁5005	-11.9742
▁pairt	-11.9744
▁nadj	-11.9778
▁tdiff	-11.9781
▁divs	-11.9783
getchar	-11.9786
▁isdigit	-11.9797
▁5);	-11.9812
▁LEFT	-11.9824
[55]	-11.9837
-|""	-11.9837
-6	-11.9843
app	-11.9846
numberOfElements	-11.9848
9"	-11.9874
▁To	-11.9895
▁'2'	-11.9903
▁prohibited	-11.992
▁wait	-11.9948
father	-11.9951
+2	-11.9966
store	-11.9967
▁army	-11.9969
▁600	-11.9981
▁binary	-11.9982
▁mmin	-11.9983
▁column	-11.9987
+1]-	-11.9993
[27]	-11.9997
med	-12
▁discounts	-12
▁90	-12.0001
tt	-12.0017
-1.0	-12.0021
▁per	-12.0028
▁palabra	-12.0031
▁text	-12.0034
▁10010	-12.0045
▁Anton	-12.005
big	-12.0074
bak	-12.0077
▁fail	-12.0093
▁ref	-12.0104
▁9999999	-12.0114
dot	-12.0116
(10)	-12.0133
▁dd	-12.0137
▁hb	-12.0138
ver	-12.0143
▁maxv	-12.0143
▁pe	-12.0172
▁Time	-12.0173
▁prep	-12.0178
dem	-12.0179
▁isgro	-12.0181
1+	-12.0185
▁minP	-12.0191
▁vasya	-12.0207
▁maxl	-12.0212
▁maxcnt	-12.0215
ong	-12.0226
1.0	-12.0229
*2	-12.0242
answer	-12.0245
▁101,	-12.0268
▁hor	-12.0278
6,	-12.0279
te	-12.0305
se	-12.0313
counts	-12.035
#.#.#.#.|	-12.0352
players	-12.0354
Found	-12.0354
▁505	-12.0357
▁atoi	-12.0359
▁ios	-12.0365
1=	-12.0368
stripe	-12.0369
+1)/2	-12.0371
▁jarak	-12.0374
▁alph	-12.0375
transform	-12.0379
▁smL	-12.038
▁small	-12.0381
▁cant	-12.0383
▁ud	-12.0383
▁posx	-12.0384
▁smR	-12.0385
▁End	-12.0388
▁nearest	-12.039
▁comparator	-12.039
Min	-12.0392
▁desk	-12.0402
days	-12.0404
▁47	-12.0415
▁numedges	-12.0416
high	-12.0416
[1000][1000]	-12.0417
(1)	-12.0421
▁satu	-12.0423
▁enemy	-12.0439
▁fo	-12.0448
type	-12.0448
▁dua	-12.0451
[0]--;	-12.0453
▁""=""	-12.0457
match	-12.0459
▁cols	-12.046
▁drink	-12.0465
86400	-12.0467
udmoves	-12.047
soroban	-12.0477
▁kq	-12.0478
▁anton	-12.0479
short	-12.0479
▁sisa	-12.0479
▁primos	-12.049
odd	-12.0492
4)	-12.0499
▁Danik	-12.051
▁tempm	-12.0511
▁maxSize	-12.0516
▁numver	-12.0521
▁criba	-12.0523
▁OUTPUT	-12.0541
▁If	-12.0548
()])	-12.0552
▁foo	-12.0553
▁fir	-12.0561
decrease	-12.0571
▁(-1)	-12.0571
INF	-12.0587
nums	-12.059
▁nuts	-12.0609
[1][2])	-12.0618
▁yf	-12.0633
("""")	-12.0635
▁LO	-12.0638
▁possible	-12.0642
[200000	-12.0643
▁opt	-12.0649
▁0.5	-12.065
[4])	-12.0655
▁sta	-12.0658
▁yb	-12.0677
are	-12.0684
▁Ehab	-12.0715
esp	-12.0723
▁woman	-12.0726
▁Mahmoud	-12.0732
▁def	-12.0733
▁pa	-12.0733
zero	-12.0738
▁1000010	-12.0756
▁pointe	-12.0771
]-'0'	-12.0782
▁rad	-12.0788
oy	-12.081
ncr	-12.082
|""	-12.0821
▁2147483647	-12.0833
[1000006]	-12.0834
▁7-	-12.0838
showpoint	-12.0846
▁shengyu	-12.085
▁digits	-12.0853
▁occ	-12.0871
ha	-12.0875
▁INFF	-12.0876
▁(26	-12.0877
▁oil	-12.0878
#.#.#.|.|)""	-12.0881
.........|""	-12.0883
▁arra	-12.0884
iter	-12.0884
board	-12.0898
▁Next	-12.0899
...............	-12.0905
▁97)	-12.0916
▁smallest	-12.0919
hh	-12.0928
▁yellow	-12.093
▁only	-12.0933
grid	-12.0939
▁180)	-12.0942
3);	-12.0953
lessons	-12.0962
▁1000000000;	-12.0964
status	-12.0965
Bulbasaur	-12.0978
8;	-12.0983
key	-12.0994
▁tag	-12.0997
[110][110];	-12.1002
▁qmarks	-12.1003
fb	-12.1005
than	-12.1007
▁INPUT	-12.1042
▁getline	-12.1043
▁3.14159	-12.1048
▁pointers	-12.1051
▁Minb	-12.1059
▁fla	-12.106
err	-12.1066
▁hj	-12.1087
=-1	-12.1132
maximum	-12.1139
[2].	-12.1152
cn	-12.1161
2),	-12.1169
)*	-12.1172
▁100100	-12.1175
(0	-12.1184
▁4);	-12.1187
▁may	-12.1193
[100	-12.1199
▁500;	-12.1204
Arr	-12.1206
fl	-12.1208
▁sss	-12.1223
with	-12.1231
way	-12.1245
▁21)	-12.125
▁97;	-12.1257
▁nowp	-12.1268
▁abc	-12.1271
▁gc	-12.1276
100,	-12.134
▁remain	-12.1344
"}	-12.1348
▁third	-12.1349
▁qClose	-12.135
▁inicial	-12.135
▁perColor	-12.135
▁uppercase	-12.135
▁jumlahganjil	-12.135
▁process	-12.1352
▁LINF	-12.1353
▁numero	-12.1353
▁differ	-12.1358
▁suck	-12.1358
.|	-12.1358
▁fuck	-12.1358
▁walk	-12.1384
▁buffer	-12.1386
▁friends	-12.1393
▁beginat	-12.1395
▁305	-12.1398
▁31;	-12.1401
▁tank	-12.1401
[1][1])	-12.1419
▁xxx	-12.1419
[10010];	-12.1431
▁nxt	-12.1439
Number	-12.1439
▁deque	-12.144
▁minm	-12.145
mas	-12.1451
▁tri	-12.1451
▁Incorrect	-12.1459
▁'!')	-12.1461
by	-12.1472
▁fpow	-12.1475
[1]);	-12.1483
▁MAXT	-12.1484
[15]	-12.1484
▁send	-12.1484
winner	-12.1485
▁ppow	-12.1486
▁sheets	-12.1486
fill	-12.1489
][0],	-12.1494
▁Way	-12.1496
isalpha	-12.1503
.#.#.#.#.#.#.#.|	-12.1508
ns	-12.1514
▁cups	-12.1519
▁fac	-12.1525
▁commands	-12.1535
▁inve	-12.1535
SI	-12.155
▁flagA	-12.1558
(360	-12.1561
[120];	-12.1579
▁zsum	-12.1584
▁slot	-12.1589
▁100000000	-12.159
over	-12.1595
▁1][2])	-12.1597
▁122)	-12.1609
][1],	-12.1617
3[0]	-12.1632
#.#.#.#.#.#.#.#.	-12.1645
amt	-12.1647
asd	-12.1691
▁ust	-12.17
▁freopen	-12.1709
▁chk	-12.171
▁""4	-12.1711
sp	-12.1718
▁sag	-12.1729
[0][0],	-12.1749
'])	-12.1754
▁14	-12.1805
▁lin	-12.1805
el	-12.1808
▁pb	-12.1818
]][	-12.1822
▁999999999	-12.1824
▁((1	-12.1837
#.#.#.|.|""	-12.1842
▁2.0	-12.1854
▁follow	-12.1866
(""-1"")	-12.1873
▁error	-12.1879
aa	-12.1885
▁blyat	-12.1894
▁degree	-12.1894
▁boxes	-12.1894
▁horizontal	-12.1895
eight	-12.1907
▁gla	-12.1909
▁nextPrime	-12.1914
▁capacity	-12.1914
▁denominator	-12.1914
oop	-12.1918
▁50;	-12.1924
▁pangkat	-12.1937
▁forward	-12.1939
▁conv	-12.1945
▁bitset	-12.1952
▁101;	-12.196
ul	-12.1961
▁Misha	-12.1962
▁medals	-12.1963
▁hangx	-12.1965
▁coty	-12.1965
▁'2')	-12.1984
_2	-12.1988
▁factors	-12.1989
▁rprev	-12.2
book	-12.2002
py	-12.2033
▁'6'	-12.2035
()"	-12.2043
isupper	-12.2072
▁locg	-12.2072
▁normal	-12.2075
▁nama	-12.208
beat	-12.2084
---------+	-12.2093
[200005]	-12.2095
[1]))	-12.2099
ways	-12.2107
▁he	-12.2111
▁pas	-12.2116
(0.0);	-12.2126
▁(5	-12.213
[2][1])	-12.214
▁2));	-12.2159
▁(8	-12.2165
▁prefix	-12.2187
chat	-12.2215
▁pd	-12.2219
dd	-12.2222
[105][105]	-12.2238
▁odds	-12.2247
ax	-12.2272
▁Bulbasaur	-12.2273
▁'3'	-12.2282
▁maxsum	-12.2309
be	-12.2312
▁neo	-12.2313
bru	-12.2317
▁dc	-12.2328
'};	-12.2335
def	-12.2344
[201]	-12.2361
▁block	-12.2365
▁xb	-12.2366
▁colors	-12.2374
even	-12.2376
▁rr	-12.2409
[2001];	-12.2412
▁face	-12.2413
erosOnes	-12.2427
▁mindis	-12.2427
.#.|	-12.2428
(""0"")	-12.2428
[8][8]	-12.2429
▁ziro	-12.2431
▁encrypt	-12.2431
▁maxExcl	-12.2431
▁brainfuck	-12.2431
▁mohi	-12.2433
▁null	-12.2433
▁trump	-12.2434
.#.#.|	-12.2435
00	-12.2436
▁File	-12.2436
▁foot	-12.2439
▁200100	-12.2445
▁mius	-12.2446
▁highest	-12.2451
.#.#.#.|	-12.2453
.#.#.#.#.#.#.|	-12.2458
[(	-12.2458
▁caso	-12.2459
.#.#.#.#.|	-12.2462
_4	-12.2463
.#.#.#.#.#.|	-12.2468
▁111	-12.2468
▁limak	-12.2469
▁matching	-12.2471
▁dict	-12.2473
#.#.#.#.#.#.|	-12.2483
▁']'	-12.2484
']['	-12.2489
▁17	-12.2489
▁rides	-12.2489
▁cntfloat	-12.249
▁soma	-12.2494
down	-12.2498
▁merge	-12.25
▁"":""	-12.2501
▁lat	-12.2502
▁(*	-12.2507
▁huruf	-12.2511
▁busca	-12.2512
▁4)]	-12.2513
startx	-12.2522
▁mole	-12.2526
acos	-12.2529
minmum	-12.2531
▁blu	-12.2539
5],	-12.2541
▁xorr	-12.2548
▁welfare	-12.2554
ber	-12.2566
▁prim	-12.2587
10;	-12.2591
▁Start	-12.2594
▁minIncl	-12.2596
▁perm	-12.2598
▁pntr	-12.2599
▁xsum	-12.2604
good	-12.2611
▁path	-12.2617
▁Dp	-12.262
▁maks	-12.2628
▁**	-12.2628
point	-12.263
rs	-12.2631
TOWARDS	-12.2633
une	-12.2633
▁seg	-12.2646
▁sym	-12.265
fact	-12.2654
dig	-12.266
▁1][2]))	-12.2661
▁jol	-12.2662
decimal	-12.2675
can	-12.271
usa	-12.2731
▁csx	-12.2733
▁la	-12.2736
▁modd	-12.2743
▁0);	-12.2746
▁ant	-12.2746
3++;	-12.2747
▁Num	-12.2754
▁slen	-12.2774
▁restaurants	-12.2782
gh	-12.2797
fingers	-12.281
Count	-12.2819
tam	-12.2824
▁charnum	-12.2831
▁isn	-12.2837
▁gov	-12.284
[12];	-12.2868
▁10001	-12.2882
[500];	-12.2894
▁40	-12.2911
▁xs	-12.2912
▁niz	-12.2913
▁'{'	-12.2934
▁jwb	-12.2945
15	-12.2958
'}	-12.2985
▁umb	-12.2992
▁lens	-12.2999
▁O	-12.3
▁righ	-12.3004
Gym	-12.3015
Infinite	-12.3015
eaten	-12.3016
[15][15]	-12.3016
(""1"")	-12.3018
▁minCol	-12.3019
▁maxRow	-12.3019
▁minRow	-12.3019
▁maxCol	-12.3019
▁olnum	-12.3019
▁indimpar	-12.302
▁indpar	-12.302
▁assert	-12.3021
▁lenght	-12.3023
▁choc	-12.3024
▁ori	-12.3033
[1001][1001]	-12.3036
▁malloc	-12.3039
▁numPairs	-12.3039
]+	-12.304
▁hari	-12.3053
▁initial	-12.3059
▁lvl	-12.306
▁stck	-12.3066
▁100002	-12.3073
▁bo	-12.3078
▁midTime	-12.3079
▁orgStr	-12.3082
▁posiciones	-12.3084
▁findfa	-12.3087
▁97]	-12.3092
▁MAT	-12.3094
sx	-12.3094
▁((2	-12.3104
▁lft	-12.311
▁stud	-12.3119
▁this	-12.3121
▁Yellow	-12.3127
▁jumps	-12.3128
power	-12.3133
▁90)	-12.3135
▁before	-12.314
▁byte	-12.3141
)/	-12.3141
▁19	-12.3147
sir	-12.3149
▁7);	-12.3153
▁pen	-12.3183
▁syl	-12.3186
▁isp	-12.319
file	-12.3192
▁Cb	-12.3194
▁lines	-12.321
▁nike	-12.3215
▁candidate	-12.3215
distance	-12.3234
pass	-12.3243
tolower	-12.3247
Finite	-12.3251
▁era	-12.3255
diag	-12.3258
leafeon	-12.326
mnm	-12.3261
flareon	-12.3262
sylveon	-12.3264
umbreon	-12.3266
bacterias	-12.3269
search	-12.3269
isgro	-12.3271
prefix	-12.3275
gov	-12.3278
▁seed	-12.3279
▁till	-12.3281
▁stat	-12.3289
▁las	-12.3291
(8);	-12.33
▁mass	-12.3309
▁27)	-12.3321
▁flat	-12.3323
inv	-12.3343
▁(0)	-12.3357
ms	-12.3362
▁nam	-12.3362
▁child	-12.3375
maxs	-12.3393
▁taken	-12.3395
▁sorted	-12.3403
rt	-12.3405
[11][11];	-12.3421
▁fingers	-12.3422
▁fim	-12.3436
▁inter	-12.3441
▁sam	-12.3458
▁main	-12.3463
▁1000006	-12.3466
ls	-12.3521
=1000000007	-12.355
[1]--;	-12.3557
1][0],	-12.3559
ada	-12.3565
[0][1];	-12.3577
lose	-12.3599
[13]	-12.3599
▁maxc	-12.3605
▁Mina	-12.3618
buil	-12.3623
Dec	-12.3626
[101][101]	-12.3627
▁ite	-12.3639
sy	-12.3639
getFactorization	-12.364
▁momo	-12.364
▁wynik	-12.3643
▁negro	-12.3643
▁salir	-12.3643
▁blanco	-12.3644
▁amazing	-12.3644
▁FindLen	-12.3644
[10000000]	-12.3644
▁nogover	-12.3644
▁lowest	-12.3644
▁occurances	-12.3644
▁tramp	-12.3644
▁tpresents	-12.3644
▁gotodown	-12.3644
▁destination	-12.3644
▁-2019	-12.3644
▁colCount	-12.3645
▁fastio	-12.3646
debug	-12.3648
▁ganjil	-12.3657
▁iskom	-12.3665
▁nilai	-12.3665
▁previousConte	-12.3666
▁1][0])	-12.3673
ff	-12.3674
▁tep	-12.3676
▁cs	-12.3684
▁passengers	-12.3689
▁divisores	-12.369
▁valori	-12.3692
▁110;	-12.3696
▁city	-12.3704
hang	-12.3707
▁slice	-12.3707
▁wrong	-12.3711
▁profits	-12.3712
▁adder	-12.3718
oys	-12.372
▁minute	-12.372
▁Chess	-12.3734
▁posibles	-12.3736
▁lime	-12.3736
[2005]	-12.3736
ts	-12.374
▁'3')	-12.3741
▁tra	-12.3747
[5])	-12.3748
]];	-12.3749
▁ptr	-12.3749
▁eaten	-12.3751
tem	-12.3751
........|""	-12.3752
▁inc	-12.3756
▁maxle	-12.3761
▁256	-12.3764
▁maxcount	-12.3766
▁""8""	-12.377
▁cCount	-12.3776
▁pet	-12.3778
▁4000	-12.3788
▁(10	-12.3798
(((3	-12.3798
ant	-12.3804
▁2000000000	-12.3804
[40]	-12.3818
▁compari	-12.3819
(*	-12.3823
[2000];	-12.3833
▁nimpar	-12.3844
▁ha	-12.3849
▁od	-12.3867
Len	-12.3876
▁un	-12.3877
▁suf	-12.388
▁4))	-12.3891
▁incremented	-12.3897
lower	-12.3899
side	-12.391
▁""[]""	-12.3916
hase	-12.3917
Total	-12.3919
table	-12.3924
discount	-12.3925
jolteon	-12.3931
glaceon	-12.3931
-1-	-12.3937
▁ho	-12.3941
▁cdays	-12.3942
▁yt	-12.3952
cap	-12.3954
maxy	-12.3956
spf	-12.3962
-1]+	-12.3962
▁gp	-12.3969
tab	-12.3975
abc	-12.398
ngh	-12.3992
▁Bob	-12.4002
2];	-12.4004
▁checker	-12.4008
▁load	-12.401
▁ops	-12.4011
▁1]),	-12.4012
far	-12.4021
(12)	-12.4021
arg	-12.4022
ifstream	-12.4032
incremented	-12.4033
▁Alice	-12.4038
cr	-12.4041
▁maxnum	-12.4051
go	-12.4082
▁(-1	-12.4091
MOD	-12.4092
▁cut	-12.4095
▁timer	-12.4096
gr	-12.4112
bus	-12.4113
▁(__	-12.4114
▁divi	-12.4118
)/2	-12.4123
240	-12.4138
ele	-12.4147
coun	-12.4157
ust	-12.4163
[400];	-12.4171
[9];	-12.4179
▁npar	-12.4191
pw	-12.4192
▁rx	-12.4194
2])	-12.4207
mode	-12.422
▁rank	-12.423
▁(_	-12.4231
currnum	-12.4239
item	-12.4252
▁3000	-12.4267
▁0.0	-12.4275
▁1111	-12.4281
[15];	-12.4287
State	-12.4306
wheniEndFromLeft	-12.4306
▁woch	-12.4307
▁capital	-12.431
▁getChar	-12.431
▁indefinitely	-12.4311
▁getAns	-12.4311
▁losp	-12.4311
▁patt	-12.4312
▁frr	-12.4318
▁losn	-12.4322
']);	-12.4323
▁24;	-12.4326
▁kecil	-12.4328
▁nrod	-12.4332
▁shelves	-12.4333
[51][51];	-12.4341
▁groups	-12.4343
▁1][1])	-12.4348
▁bul	-12.4351
▁actual	-12.4355
▁izq	-12.4356
▁bill	-12.4356
▁blockb	-12.4356
▁chance	-12.4357
▁gb	-12.4359
▁maap	-12.436
▁ke	-12.4362
(8	-12.4362
▁norm	-12.4363
▁rla	-12.4366
▁texto	-12.4367
▁tipe	-12.4372
[200000];	-12.4377
.#.#.#.#.#.#.#.	-12.438
▁Ids	-12.438
▁yelo	-12.438
▁tmpb	-12.4381
▁Freq	-12.4381
▁spyke	-12.4382
▁spykeId	-12.4383
▁99999999	-12.4383
▁Primes	-12.4387
bal	-12.4394
▁NULL	-12.4397
pointer	-12.4398
▁minimun	-12.44
▁coin	-12.4405
▁ifstream	-12.4406
▁suml	-12.4411
.............|	-12.4412
▁mc	-12.4413
▁sumx	-12.4421
[305];	-12.4422
............|	-12.4422
▁blocka	-12.4424
▁press	-12.443
▁boox	-12.4441
▁Res	-12.4443
▁maxr	-12.4448
▁100009	-12.445
▁'}')	-12.4457
▁360;	-12.4459
▁mima	-12.4465
▁ten	-12.447
▁gh	-12.4475
▁100005;	-12.4482
▁works	-12.4482
▁rtn	-12.4504
▁terminate	-12.4513
▁prefs	-12.4516
▁'0']	-12.4518
▁Ta	-12.4534
▁cprice	-12.4535
▁210	-12.4535
01	-12.4538
▁loser	-12.454
▁fans	-12.4546
▁jjj	-12.4555
▁10))	-12.4574
times	-12.4578
▁scored	-12.4582
remainder	-12.4583
▁target	-12.4585
▁added	-12.4585
ment	-12.4592
▁minval	-12.4603
▁1.0))	-12.4604
otes	-12.4615
▁'>')	-12.4618
▁letterx	-12.4626
graph	-12.4629
▁te	-12.4637
flg	-12.4637
▁ro	-12.4638
▁prevr	-12.4645
black	-12.4647
[111];	-12.4648
require	-12.4649
checker	-12.4651
▁10000000000	-12.4659
-1)/2	-12.4663
[10][10]	-12.4664
▁cast	-12.4678
np	-12.4717
chars	-12.4729
lt	-12.4741
▁iterations	-12.4749
inner	-12.4784
est	-12.4791
▁pB	-12.4792
▁{""	-12.4814
▁comb	-12.4814
▁cntb	-12.4829
8""	-12.483
[2]++;	-12.4832
fix	-12.4833
seq	-12.4836
▁qy	-12.4844
sup	-12.4849
▁'_'	-12.4861
▁countb	-12.4869
ry	-12.4881
▁5001;	-12.4884
110	-12.4892
numbers	-12.4892
indx	-12.491
▁six	-12.4913
[-1]	-12.492
3.	-12.4926
Ans	-12.4949
▁SEGMENT	-12.4964
[7];	-12.4967
uantity	-12.5006
Star	-12.5012
--------+	-12.5018
▁DeleteIt	-12.5021
▁fristOven	-12.5021
▁thisChar	-12.5021
▁girl	-12.5021
klmnopqrstuvwxyz	-12.5021
▁invfact	-12.5021
▁starCount	-12.5021
▁Init	-12.5021
▁ttoalha	-12.5023
▁seive	-12.5024
[50][50]	-12.5025
▁numeric	-12.5029
▁toalha	-12.5036
move	-12.504
▁tiga	-12.5047
▁bucket	-12.5048
▁borrow	-12.5048
▁tConOven	-12.5048
▁besar	-12.5049
▁masha	-12.505
(180	-12.5051
▁444	-12.5051
votes	-12.5052
pq	-12.5064
▁100007	-12.5071
▁Roz	-12.5072
▁tedad	-12.5073
▁faces	-12.5073
▁banyakganjil	-12.5076
▁ganjilterkecil	-12.5076
▁buy	-12.5078
▁nextz	-12.5089
▁strArr	-12.5094
[205];	-12.5095
▁pearls	-12.5095
▁kpk	-12.5098
▁Tie	-12.5098
▁distinct	-12.5102
▁bulbs	-12.5104
'\	-12.511
▁hot	-12.5115
[2001]	-12.5115
▁strength	-12.5116
▁sheet	-12.5117
ake	-12.5121
▁128	-12.5121
▁tren	-12.5126
28	-12.5127
▁cube	-12.5129
[20]	-12.513
▁PhoneArray	-12.513
▁50)	-12.5135
▁LL	-12.5135
▁fp	-12.5137
▁goo	-12.5139
▁cyc	-12.5144
vocale	-12.5148
.#.#.#.#.#.|.|)	-12.515
wt	-12.5168
▁println	-12.5171
my	-12.5174
▁disc	-12.5175
▁viii	-12.5177
▁greate	-12.5192
▁lock	-12.5208
▁mcd	-12.5218
▁1000000001	-12.523
▁mCount	-12.523
2=0	-12.5237
▁piso	-12.5242
▁va	-12.5248
▁1000)	-12.5251
ither	-12.5253
▁57	-12.5259
▁ru	-12.528
---------	-12.5289
▁encontrado	-12.5294
anu	-12.531
▁99	-12.5312
#.#.#.|	-12.532
▁got	-12.5328
▁-1000	-12.533
▁32)	-12.5336
▁imin	-12.5352
▁nok	-12.5363
▁xor	-12.5364
[35]	-12.5366
coins	-12.537
▁fib	-12.5371
▁dic	-12.5384
boolean	-12.5388
speed	-12.5405
edges	-12.5406
▁so	-12.5412
save	-12.5414
▁gox	-12.5414
▁ce	-12.5418
buff	-12.5424
vote	-12.5425
slot	-12.5425
▁2010	-12.5426
acef	-12.5428
node	-12.5434
'6'	-12.5441
/2)	-12.5448
[505];	-12.5462
▁ry	-12.5465
▁gv	-12.5466
▁exa	-12.5478
---------------+	-12.549
▁((3	-12.5494
▁ls	-12.5499
▁lenp	-12.5505
]]--;	-12.5508
Ma	-12.5526
▁minA	-12.5533
-3]	-12.5548
words	-12.557
▁sel	-12.5573
maxm	-12.5577
dsa	-12.5586
▁non	-12.559
▁kh	-12.56
▁jmin	-12.5602
▁cw	-12.5614
▁999	-12.5636
▁wt	-12.5639
▁1007	-12.5646
)),	-12.5662
----------	-12.5669
▁1)))	-12.5679
▁'='	-12.5732
▁leave	-12.5747
."";	-12.576
▁'0'))	-12.5762
10,	-12.5766
▁mot	-12.577
▁join	-12.5778
XXL	-12.5789
▁Otherwise	-12.579
▁DashaCount	-12.579
▁supply	-12.579
▁infinity	-12.579
▁itself	-12.579
[100007]	-12.5792
▁blocked	-12.5792
▁shit	-12.5802
(':')	-12.5803
▁Long	-12.5805
▁prevI	-12.5808
▁quit	-12.5813
/2+1	-12.5815
[200][200]	-12.5815
▁colom	-12.5816
▁insect	-12.5818
▁edits	-12.5818
▁diamond	-12.5819
▁CityCode	-12.5819
▁sleepTime	-12.5819
▁consecutive	-12.582
▁numerator	-12.582
[1005][1005];	-12.5821
▁failed	-12.5822
▁MAXX	-12.5825
▁FB	-12.5826
▁1024	-12.5831
strgro	-12.5835
1],	-12.5841
▁javab	-12.5847
biggest	-12.5851
▁rub	-12.5855
▁safe	-12.5856
▁300005	-12.5857
▁packs	-12.5859
...........|	-12.586
▁MAXM	-12.5863
▁trig	-12.5866
................	-12.5866
▁modpow	-12.5867
▁itung	-12.5871
▁form	-12.5873
▁ivmind	-12.5876
▁esPrimo	-12.5877
▁modu	-12.5878
--------------+	-12.5883
▁sumodd	-12.5886
